# 연습문제(2) 

## #01. 작업준비

### 패키지 가져오기

In [5]:
import sys
import os
import numpy as np
import seaborn as sb
import pandas as pd
from matplotlib import pyplot as plt

### 직접 만든 모듈의 위치(폴더)를 파이썬에 등록

#### 직접 만든 모듈 참조

### 데이터 불러오기

In [7]:
df = pd.read_excel('https://data.hossam.kr/D02/wage.xlsx')
df

      year  age            maritl  ... health_ins   logwage        wage
0     2006   18  1. Never Married  ...      2. No  4.318063   75.043154
1     2004   24  1. Never Married  ...      2. No  4.255273   70.476020
2     2003   45        2. Married  ...     1. Yes  4.875061  130.982177
3     2003   43        2. Married  ...     1. Yes  5.041393  154.685293
4     2005   50       4. Divorced  ...     1. Yes  4.318063   75.043154
...    ...  ...               ...  ...        ...       ...         ...
2995  2008   44        2. Married  ...     1. Yes  5.041393  154.685293
2996  2007   30        2. Married  ...      2. No  4.602060   99.689464
2997  2005   27        2. Married  ...      2. No  4.193125   66.229408
2998  2005   27  1. Never Married  ...     1. Yes  4.477121   87.981033
2999  2009   55      5. Separated  ...     1. Yes  4.505150   90.481913

[3000 rows x 11 columns]

## 문제 1, 2

데이터를 로드하여 명목형 변수를 1, 2 등으로 레이블링 하시오. 값의 종류는 데이터프레임으로부터 조회하여 확인하시오.

레이블링 된 명목형 변수를 category 타입으로 변경하시오.

### 명목형 변수 처리 및 라벨링

#### 데이터의 유형

In [8]:
df.dtypes

year            int64
age             int64
maritl         object
race           object
education      object
region         object
jobclass       object
health         object
health_ins     object
logwage       float64
wage          float64
dtype: object

In [9]:
ilist = list(df.dtypes.index)

#### 특정 변수의 데이터 종류 파악

In [12]:
vlist = list(df.dtypes.values)
vlist

[dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('float64'),
 dtype('float64')]

In [17]:
cdf = df.copy()
for i,v in enumerate(vlist) :
    if v=="object":
        field_name =ilist[i]
        # print(field_name)
        ## value_counts 하기 
        vc = cdf[field_name].value_counts()
        print(vc)

maritl
2. Married          2074
1. Never Married     648
4. Divorced          204
5. Separated          55
3. Widowed            19
Name: count, dtype: int64
race
1. White    2480
2. Black     293
3. Asian     190
4. Other      37
Name: count, dtype: int64
education
2. HS Grad            971
4. College Grad       685
3. Some College       650
5. Advanced Degree    426
1. < HS Grad          268
Name: count, dtype: int64
region
2. Middle Atlantic    3000
Name: count, dtype: int64
jobclass
1. Industrial     1544
2. Information    1456
Name: count, dtype: int64
health
2. >=Very Good    2142
1. <=Good          858
Name: count, dtype: int64
health_ins
1. Yes    2083
2. No      917
Name: count, dtype: int64

#### 범용적인 경우를 고려한 코드

#### 직접 만든 모듈을 활용

## 문제 3

수치형 변수에 대한 요약 통계를 확인하고 설명하시오

## 문제 4

명목형 변수에 대한 기술 통계를 수행하고 설명하시오.

## 문제 5

결혼 여부에 따른 임금 수준을 비교하고자 한다. 결혼 여부에 따라 서브플롯을 구성하여 임금 수준을 히스토그램으로 시각화 하고 설명하시오.

## 문제 6

교육 수준에 따른 임금에 대한 히스토그램을 시각화 하고 설명하시오. 교육수준별로 그래프를 나누어 서브플롯으로 제시해야 합니다.